<template>
    <div>
      <ProgramInfo v-for="program in programs" :key="program.title" :program="program" :tabChannel="0"></ProgramInfo>
    </div>
  </template>
  
  <script>
  export default {
    computed: {
      programs() {
        return [
          {
            ...this.$kikaku('nankyoku'),
            key: 'nankyoku',
            channels: [0],
            links: this.$festival('before'),
            reviews: [
              {
                type: 'text',
                content:
                  '[地球](ちきゅう)の[果](は)ての[極寒](ごっかん)の[地](ち)、[南極](なんきょく)。そこでは、[独自](どくじ)の[工夫](くふう)を[凝](こ)らして[生](い)きる[生き物](いきもの)や、[一見](いっけん)[不思議](ふしぎ)な「[氷](こおり)」にまつわる[科学](かがく)[現象](げんしょう)が[見](み)られますが、[実](じつ)はその[秘密](ひみつ)は[身近](みぢか)にあります。ここでは、お[見](み)せした[実験](じっけん)についてもう[一度](いちど)[振](ふ)り[返](かえ)りたいと[思](おも)います。',
              },
              {
                type: 'title',
                content: '[毛皮](けがわ)',
              },
              {
                type: 'text',
                content:
                  '[史上](しじょう)[最低](さいてい)の[気温](きおん)として-90℃が[記録](きろく)されているほどの[南極](なんきょく)において、[生](い)き[物](もの)たちはどうやってその[寒](さむ)さに[耐](た)えているのでしょうか。その[答](こた)えはいたってシンプルで、アザラシなどの[動物](どうぶつ)はその[分厚](ぶあつ)い[毛皮](けがわ)によって[体温](たいおん)を[維持](いじ)しているのです。[実験](じっけん)では、[毛皮](けがわ)で[覆](おお)ったものと、[何](なに)もしないものとでは、[温度](おんど)の[変化](へんか)の[仕方](しかた)にハッキリとした[違](ちが)いがあることが[確](たし)かめられました。[寒](さむ)い[冬](ふゆ)に[凍](こご)えずに[済](す)むのは[羨](うらや)ましいですが、[夏](なつ)は[少](すこ)し[暑](あつ)そうです。[一年中](いちねんじゅう)[寒](さむ)い[南極](なんきょく)だからこそ、そこに[生](い)きる[生](い)き[物](もの)たちはこのような[進化](しんか)を[遂](と)げたのですね。',
              },
              {
                type: 'title',
                content: 'ペンギンの[血管](けっかん)',
              },
              {
                type: 'text',
                content:
                  '[生](い)き[物](もの)が[寒](さむ)さを[防](ふせ)ぐ[工夫](くふう)は、[毛皮](けがわ)だけではありません。ペンギンの[脚](あし)などの[血管](けっかん)は、「[奇網](きもう)（きもう）」と[呼](よ)ばれる[特別](とくべつ)な[構造](こうぞう)をしています。[生](い)き[物](もの)の[血管](けっかん)は、[心臓](しんぞう)から[流](なが)れ[出](で)る[血液](けつえき)を[送](おく)る「[動脈](どうみゃく)」と、[心臓](しんぞう)へ[血液](けつえき)を[送](おく)り[返](かえ)す「[静脈](じょうみゃく)」からなっています。[心臓](しんぞう)から[送](おく)り[出](だ)されたばかりの[血液](けつえき)は[温](あたた)かいため、[動脈](どうみゃく)も[温](あたた)かくなっています。ここで、[脚](あし)の[表面](ひょうめん)[近](ちか)くに[動脈](どうみゃく)があったらどうでしょうか。[温](あたた)かい[皮膚](ひふ)が[冷](つめ)たい[氷](こおり)を[踏](ふ)んだら、その[温度](おんど)[差](さ)によって[体](からだ)の[熱](ねつ)が[急速](きゅうそく)に[奪](うば)われてしまいます。そこで、ペンギンの[脚](あし)では、[静脈](じょうみゃく)が[動脈](どうみゃく)に[巻](ま)きつくような[形](かたち)にすることで、あえて[脚](あし)[先](さき)の[温度](おんど)を[下](さ)げています。そうすることで、[脚](あし)と[氷](こおり)との[温度](おんど)[差](さ)を[縮](ちぢ)めることができ、[体温](たいおん)が[奪](うば)われるのを[防](ふせ)ぐことができるのです。[実験](じっけん)では、チューブにお[湯](ゆ)を[通](とお)し、[冷](ひ)やす[前](まえ)の[部分](ぶぶん)と[冷](ひ)やした[後](あと)の[部分](ぶぶん)を[一緒](いっしょ)にねじった[状態](じょうたい)にすることで、お[湯](ゆ)の[温度](おんど)の[低下](ていか)を[和ら](やわら)げることができることを[示](しめ)しました。ペンギンの[足元](あしもと)でこんな[複雑](ふくざつ)なことが[行](おこな)われていたなんて、[可愛](かわい)い[見](み)た[目](め)をして[侮](あなど)れませんね。',
              },
              {
                type: 'title',
                content: '[氷](こおり)の[膨張](ぼうちょう)と[浮力](ふりょく) ',
              },
              {
                type: 'text',
                content:
                  '[南極](なんきょく)といえば、やはり[一面](いちめん)を[覆](おお)う[氷](こおり)の[世界](せかい)が[思](おも)い[浮](う)かびます。[多](おお)くの[氷](こおり)は[陸](りく)の[上](うえ)にありますが、[一部](いちぶ)の[氷](こおり)は「[棚氷](たなごおり)」として[海](うみ)の[上](うえ)へ[張](は)り[出](だ)したり、「[海氷](かいひょう)」や「[氷山](ひょうざん)」として[浮](う)かんでいたりします。ところで、どうしてこの[氷](こおり)は[沈](しず)まないのでしょうか？[飲](の)み[物](もの)を[入](い)れたコップの[中](なか)に[氷](こおり)が[浮](う)かんでいる[様子](ようす)などは[見慣](みな)れていると[思](おも)うので、[疑問](ぎもん)に[思](おも)うことも[少](すく)ないかもしれませんが、[実](じつ)は[不思議](ふしぎ)な[現象](げんしょう)です。[実験](じっけん)では、[実際](じっさい)に[水](みず)を[凍](こお)らせてみることで、[氷](こおり)になると「[膨張](ぼうちょう)」するということを[確](たし)かめていただきました。[膨張](ぼうちょう)することで[氷](こおり)は[水](みず)よりも[軽](かる)くなり、[海](うみ)の[上](うえ)に[浮](う)かぶことができたのです。',
              },
              {
                type: 'title',
                content: '[凝固点](ぎょうこてん)[降下](こうか)',
              },
              {
                type: 'text',
                content:
                  '[氷](こおり)に[関係](かんけい)して、もう[一](ひと)つ[不思議](ふしぎ)なことがあります。それは、[南極](なんきょく)は0℃を[下回](したまわ)るとても[寒](さむ)い[場所](ばしょ)なのに、どうして[海](うみ)は[凍り](こおり)つかないのか、ということです。[水](みず)は0℃で[凍](こお)るはずなのに、どうしてでしょう？それには、「[凝固点](ぎょうこてん)[降下](こうか)」という[現象](げんしょう)が[関](かか)わっています。これは、[水](みず)に[他](ほか)の[物質](ぶっしつ)を[溶](と)かすと、[水](みず)が[凍](こお)る[温度](おんど)が[下](さ)がる、ということです。[実験](じっけん)では、ただの[水](みず)と、[塩](しお)を[混](ま)ぜて[海水](かいすい)に[近](ちか)づけた[水](みず)を[冷](ひ)やすことで、ただの[水](みず)は[凍](こお)ってしまうのに、[塩](しお)を[溶](と)かした[水](みず)は[凍](こお)らないことを[確](たし)かめていただきました。これは、[冷凍庫](れいとうこ)にお[醤油](しょうゆ)などを[入](い)れても[凍](こお)らないことでご[自分](じぶん)で[試](ため)してみることもできます。このような[性質](せいしつ)があることで、[南極](なんきょく)に[住](す)む[魚](さかな)も[氷](こおり)[漬](づ)けにならずに[済](す)んでいるのですね。',
              },
              {
                type: 'title',
                content: 'まとめ',
              },
              {
                type: 'text',
                content:
                  '[身](み)の[回](まわ)りにあるものを[使](つか)った[実験](じっけん)で、[南極](なんきょく)の[秘密](ひみつ)を[解](と)き[明](あ)かしてきました。[南極](なんきょく)を[少](すこ)しでも[身近](みぢか)に[感](かん)じていただけたら[嬉](うれ)しいです！',
              },
            ],
          },
          {
            ...this.$kikaku('fushigi'),
            key: 'fushigi',
            channels: [0],
            links: this.$festival('before'),
            reviews: [
              {
                type: 'text',
                content:
                  '[私](わたし)たちの[身](み)の[回](まわ)りでは、[時](とき)として[直感](ちょっかん)に[反](はん)する[不思議](ふしぎ)なことが[起](お)こります。[今回](こんかい)は、その[直感](ちょっかん)に[反](はん)するような[結果](けっか)の[出](で)る[実験](じっけん)を[行](おこな)い、どうしてそうなっているのかを[解説](かいせつ)しました。ここでは、その[実験](じっけん)と[理論](りろん)についてもう[一度](いちど)[振](ふ)り[返](かえ)ってみようと[思](おも)います。',
              },
              {
                type: 'title',
                content: '[風船](ふうせん)の[空気](くうき) ',
              },
              {
                type: 'text',
                content:
                  '[大](おお)きく[膨](ふく)らませた[風船](ふうせん)と[小](ちい)さく[膨](ふく)らませた[風船](ふうせん)を[管](かん)でつなぎ、[空気](くうき)が[行](い)き[来](き)できるようにしたら、２つの[風船](ふうせん)の[大](おお)きさはどう[変化](へんか)するだろう？という[実験](じっけん)でした。「[偏](かたよ)った２つのものを[一緒](いっしょ)にすると、その[平均](へいきん)に[近](ちか)づくのではないか」という[直感](ちょっかん)に[反](はん)し、[風船](ふうせん)は[大](おお)きいものがより[大](おお)きく、[小](ちい)さいものがより[小](ちい)さくなりました。いったいなぜでしょうか？</br>[実](じつ)は、[圧力](あつりょく)を[計算](けいさん)すると、[小](ちい)さい[風船](ふうせん)の[方](ほう)が[圧力](あつりょく)が[高](たか)くなっているのです。みなさんも、[風船](ふうせん)を[膨](ふく)らませようとしたとき、[最初](さいしょ)のほうが[大変](たいへん)だけれど、[大](おお)きくなるにつれ[楽](らく)になっていくという[経験](けいけん)をしたことはありませんか？',
              },
              {
                type: 'title',
                content: 'のぼる!?[水](みず)のふしぎ（[毛細管](もうさいかん)[現象](げんしょう)）',
              },
              {
                type: 'text',
                content:
                  '[私](わたし)たちが[普段](ふだん)[目](め)にする[水](みず)は、[蛇口](じゃぐち)から[流](なが)れるものであったり、[滝](たき)から[落](お)ちてくるものであったり、いずれにせよ[上](うえ)から[下](した)に[流](なが)れるものがほとんどです。ですが、この[実験](じっけん)ではコップに[入](はい)っていた[水](みず)がティッシュを[伝](つた)い[下](か)から[上](うえ)に[流](なが)れて[別](べつ)のコップに[移動](いどう)していきました。いったいなぜでしょうか？</br>これを[考](かんが)えるとき[鍵](かぎ)になるのが、「[毛細管](もうさいかん)[現象](げんしょう)」という[現象](げんしょう)です。[水分子](みずぶんし)[同士](どうし)は[分子](ぶんし)の[間](あいだ)に[引](ひ)っ[張](ぱ)り[合](あ)う[力](ちから)が[働](はたら)いているのですが、ティッシュのような[他](ほか)のものと[水分子](みずぶんし)の[間](あいだ)にもくっつく[力](ちから)が[働](はたら)いています。ティッシュのように[細](こま)かい[隙間](すきま)が[空](あ)いているものに[水](みず)が[少](すこ)し[引](ひ)っ[張](ぱ)り[上](あ)げられたときを[考](かんが)えると、[引](ひ)っ[張](ぱ)り[上](あ)げられた[水](みず)の[分子](ぶんし)ともとの[水面](すいめん)が[接](せっ)する[面積](めんせき)は[小](ちい)さくなるので、ティッシュなどと[水分子](みずぶんし)がくっつく[力](ちから)の[方](ほう)が、[水分子](みずぶんし)[同士](どうし)で[引](ひ)っ[張](ぱ)り[合](あ)う[力](ちから)より[大](おお)きくなります。[結果](けっか)、[水分子](みずぶんし)がすき[間](ま)に[引](ひ)っ[張](ぱ)り[上](あ)げられて[下](した)から[上](うえ)に[流](なが)れるのです。</br>また、サイフォンの[原理](げんり)といって、その[細](ほそ)い[管](かん)を[水](みず)で[満](み)たした[場合](ばあい)の[圧力](あつりょく)[差](さ)を[考](かんが)えたとき、[大気圧](たいきあつ)の[差](さ)はこの[高](たか)さの[差](さ)であれば[微々](びび)たるものであるのに対し、[最高](さいこう)[点](てん)から[折](お)り[返](かえ)した[距離](きょり)にある[水](みず)の[引](ひ)っ[張](ぱ)り[合](あ)う[力](ちから)や[重](おも)さを[比](くら)べると、[管](かん)の[先](さき)が[長](なが)い[方](ほう)に[水](みず)が[流](なが)れていくということが[起](お)こります。[実験](じっけん)のスライドでは、「ティッシュのはしごの[中](なか)の[水分子](みずぶんし)はつな[引](ひ)きをしているので、はしごが[長](なが)くて[水分子](みずぶんし)が[多](おお)い[方](ほう)に[水](みず)が[流](なが)れる」と[説明](せつめい)していますね。ですから、ティッシュの[端](はじ)が[水面](すいめん)より[高](たか)い[位置](いち)にあると、[水](みず)は[隣](となり)のコップには[移動](いどう)しないのです。',
              },
              {
                type: 'title',
                content: '[風船](ふうせん)の[重](おも)さくらべ（[浮力](ふりょく)）',
              },
              {
                type: 'text',
                content:
                  '[風船](ふうせん)といえば[軽](かる)いイメージやその[浮](う)かぶ[姿](すがた)を[思](おも)い[浮](う)かべる[人](ひと)が[多](おお)いと[思](おも)いますが、[今回](こんかい)の[実験](じっけん)では、[空気](くうき)を[入](い)れた[風船](ふうせん)は[浮](う)かばず、それどころか[空気](くうき)を[入](い)れていないただの[風船](ふうせん)と[重](おも)さを[比](くら)べたときには[空気](くうき)を[入](い)れた[風船](ふうせん)の[方](ほう)が[重](おも)いという[結果](けっか)が[出](で)ました。いったいなぜでしょうか？</br>これを[考](かんが)えるには、[浮力](ふりょく)についてよく[考](かんが)える[必要](ひつよう)があります。[浮力](ふりょく)とは、まわりを[囲](かこ)む[物質](ぶっしつ)の[上面](じょうめん)と[下面](かめん)の[圧力](あつりょく)[差](さ)による[上向](うえむ)きにはたらく[力](ちから)であり、[簡単](かんたん)に[言](い)い[表](あらわ)すと、「[同](おな)じ[大](おお)きさの[周](まわ)りを[囲](かこ)むもの([例](たと)えば、[空気](くうき)[中](ちゅう)なら[空気](くうき)、[水中](すいちゅう)なら[水](みず))の[重](おも)さと[同](おな)じだけ[上向](うえむ)きにはたらく[力](ちから)」です。[風船](ふうせん)にはその[大](おお)きさの[外](そと)の[空気](くうき)の[重](おも)さと[同](おな)じだけ[上向](うえむ)きに[浮力](ふりょく)がはたらいていますが、ヘリウムガスが[入](はい)った[風船](ふうせん)は[空気](くうき)よりも[軽](かる)いので[重力](じゅうりょく)よりも[浮力](ふりょく)が[大](おお)きくなって[浮](う)かび、[風船](ふうせん)の[中](なか)に[入](はい)った[空気](くうき)は[外](そと)の[空気](くうき)よりもつまっていて[重](おも)いので、ただの[風船](ふうせん)よりも[重](おも)くなる[上](うえ)、しずむのです。',
              },
              {
                type: 'title',
                content: '[光](ひかり)のふしぎ（[単色光](たんしょくこう)あて）',
              },
              {
                type: 'text',
                content:
                  '[私](わたし)たちは[普段](ふだん)からあたりまえにものの[色](いろ)を[目](め)で[見](み)ています。[例](たと)えば、[赤](あか)いボールに[白](しろ)い[光](ひかり)を[当](あ)てると[赤](あか)く、[青](あお)いボールに[白](しろ)い[光](ひかり)を[当](あ)てると[青](あお)く[見](み)えます。では、この2つのボールに[赤色](あかいろ)の[光](ひかり)を[当](あ)てたときはいったい[何色](なにいろ)に[見](み)えるでしょうか？[実](じつ)は、[赤](あか)いボールは[赤](あか)く[見](み)えますが、[青](あお)いボールは[黒](くろ)く[見](み)えてしまうのです。いったいなぜでしょうか？</br>[実](じつ)は「ものの[色](いろ)を[見](み)る」とは、そのものに[当](あ)たって[反射](はんしゃ)した[光](ひかり)の[色](いろ)を[見](み)ることであり、[例](たと)えば[赤](あか)いボールが[赤](あか)く[見](み)えるのも、すべての[光](ひかり)のうち[赤](あか)い[光](ひかり)を[反射](はんしゃ)しているからそう[見](み)えるのです。ですから[今回](こんかい)のようにある[特定](とくてい)の[色](いろ)しか[出](だ)さないレーザーの[光](ひかり)を[当](あ)てると、[当](あ)てられた[光](ひかり)をすべて[吸収](きゅうしゅう)してしまい[反射](はんしゃ)しないので、[色](いろ)が[見](み)えないということになります。ちなみに、[全](すべ)ての[光](ひかり)を[反射](はんしゃ)すると[白色](しろいろ)に、[全](すべ)ての[光](ひかり)を[吸収](きゅうしゅう)すると[黒色](くろいろ)に[見](み)えます。つまり、はじめに[白](しろ)い[光](ひかり)を[当](あ)てたのは、[実](じつ)はすべての[色](いろ)の[光](ひかり)を[当](あ)てたということだったのですね。',
              },
              {
                type: 'title',
                content: 'まとめ',
              },
              {
                type: 'text',
                content:
                  '[今回](こんかい)[扱](あつか)ったこと[以外](いがい)にも、[身](み)の[回](まわ)りで[直感](ちょっかん)に[反](はん)することはたくさん[起](お)きていると[思](おも)います。そんなとき、どうしてそうなっているかを[考](かんが)えようとするときに[助](たす)けになるかもしれないのが[科学](かがく)です。みなさんも[面白](おもしろ)い[科学](かがく)の[世界](せかい)に、ちょっと[足](あし)を[踏](ふ)み[入](い)れてみませんか。',
              },
            ],
          },
          {
            ...this.$kikaku('advanced'),
            key: 'advanced',
            channels: [0, 1],
            links: [{ url: { name: 'advanced' }, text: '[質問](しつもん)[投稿](とうこう)ページ' }],
          },
          {
            ...this.$kikaku('chokotto'),
            key: 'chokotto',
            channels: [0, 1],
          },
        ];
      },
    },
    head() {
      const title = 'ライブ企画紹介（メインチャンネル）';
      const description = this.$noRuby(this.$kikaku('live').description);
      return {
        title,
        meta: [
          { hid: 'description', name: 'description', content: description },
          { hid: 'og:description', property: 'og:description', content: description },
          { hid: 'og:title', property: 'og:title', content: title },
          { hid: 'og:url', property: 'og:url', content: 'https://ut-cast.net/mayfes2021/live/main/' },
        ],
      };
    },
  };
  </script>